Revit 2027 API
BuiltInFailures.PerformanceFailures.UnjoinedRoomSeparationLinesFound Property
 Room Separation of <element> is not joined, might cause performance issue with room boundaries computations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnjoinedRoomSeparationLinesFound { get; }
Public Shared ReadOnly Property UnjoinedRoomSeparationLinesFound As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnjoinedRoomSeparationLinesFound {
	FailureDefinitionId^ get ();
}
static member UnjoinedRoomSeparationLinesFound : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace